### AIML: Introduction: pandas (24th February 2022, Thursday)

Importing pandas

In [15]:
import pandas as pd

Adding Headers into the DataFrame

In [16]:
col_names = [ "Student ID", "Name", "Marks1", "Marks2", "Marks3", "Marks4", "Marks5", "Marks6"]
df = pd.DataFrame(columns=col_names) # Setting the columns
df

Empty DataFrame
Columns: [Student ID, Name, Marks1, Marks2, Marks3, Marks4, Marks5, Marks6]
Index: []

Adding a column to the dataFrame

In [17]:
stud1 = {
    'Student ID' : 2,
    "Name" : "Pritam Kundu", 
    "Marks1": 67, 
    "Marks2": 67,
    "Marks3": 67,
    "Marks4": 67,
    "Marks5": 67,
    "Marks6": 67
}

df = df.append(stud1, ignore_index=True) # avoid using this append method as its depricating
# ignore_index -> required as there is no row indices by default

C:\Users\User\AppData\Local\Temp\ipykernel_1712\1278917912.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(stud1, ignore_index=True) # avoid using this append method as its depricating

Generating a new dataFrame and Concatenating it to the same datFrame

In [18]:
df2 = pd.DataFrame(
    {'Student ID' : 5,
    "Name" : ["Jane Doe"],  # <- Cant pass alues without [] as it would be scaler
    "Marks1": 67, 
    "Marks2": 69,
    "Marks3": 61,
    "Marks4": 63,
    "Marks5": 65,
    "Marks6": 66}
)
df = pd.concat([df, df2], axis=0, ignore_index=True)
#  -> axis=0 => we want to concatenate row-wise

loc -> location indexer  
Simplest way to assign values to a dataFrame

In [20]:
df.loc[2] = [3, "Taki", 65, 45, 12, 90, 89, 78]
df.loc[-1] = [4, "Mitsuha", 69, 41, 12, 40, 100, 78]
df

   Student ID          Name Marks1 Marks2 Marks3 Marks4 Marks5 Marks6
 0          2  Pritam Kundu     67     67     67     67     67     67
 1          5      Jane Doe     67     69     61     63     65     66
 2          3          Taki     65     45     12     90     89     78
-1          4       Mitsuha     69     41     12     40    100     78